mongo_a_load_100000.txt
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-08 23:41:42:826 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-08 23:41:52:791 10 sec: 41490 operations; 4149 current ops/sec; est completion in 15 seconds [INSERT: Count=41490, Max=361727, Min=107, Avg=176.9, 90=204, 99=429, 99.9=2641, 99.99=5247] 
2018-12-08 23:42:00:281 17 sec: 100000 operations; 7811.75 current ops/sec; [CLEANUP: Count=1, Max=1918, Min=1918, Avg=1918, 90=1918, 99=1918, 99.9=1918, 99.99=1918] [INSERT: Count=58510, Max=52991, Min=99, Avg=125.29, 90=148, 99=245, 99.9=1085, 99.99=6951] 
[OVERALL], RunTime(ms), 17490
[OVERALL], Throughput(ops/sec), 5717.552887364208
[TOTAL_GCS_PS_Scavenge], Count, 56
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 80
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.45740423098913663
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 56
[TOTAL_GC_TIME], Time(ms), 80
[TOTAL_GC_TIME_%], Time(%), 0.45740423098913663
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1918.0
[CLEANUP], MinLatency(us), 1918
[CLEANUP], MaxLatency(us), 1918
[CLEANUP], 95thPercentileLatency(us), 1918
[CLEANUP], 99thPercentileLatency(us), 1918
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 146.70234
[INSERT], MinLatency(us), 99
[INSERT], MaxLatency(us), 361727
[INSERT], 95thPercentileLatency(us), 207
[INSERT], 99thPercentileLatency(us), 342
[INSERT], Return=OK, 100000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 02:14:13:070 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 02:14:23:033 10 sec: 31837 operations; 3183.7 current ops/sec; est completion in 22 seconds [INSERT: Count=31840, Max=2861055, Min=99, Avg=285.88, 90=234, 99=666, 99.9=4159, 99.99=14447] 
2018-12-09 02:14:32:173 19 sec: 100000 operations; 7457.66 current ops/sec; [CLEANUP: Count=1, Max=2863, Min=2862, Avg=2863, 90=2863, 99=2863, 99.9=2863, 99.99=2863] [INSERT: Count=68160, Max=99583, Min=97, Avg=130.88, 90=158, 99=243, 99.9=1000, 99.99=5163] 
[OVERALL], RunTime(ms), 19140
[OVERALL], Throughput(ops/sec), 5224.66039707419
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 71
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3709508881922675
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 71
[TOTAL_GC_TIME_%], Time(%), 0.3709508881922675
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2863.0
[CLEANUP], MinLatency(us), 2862
[CLEANUP], MaxLatency(us), 2863
[CLEANUP], 95thPercentileLatency(us), 2863
[CLEANUP], 99thPercentileLatency(us), 2863
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 180.23245
[INSERT], MinLatency(us), 97
[INSERT], MaxLatency(us), 2861055
[INSERT], 95thPercentileLatency(us), 223
[INSERT], 99thPercentileLatency(us), 368
[INSERT], Return=OK, 100000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 04:15:36:766 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 04:15:46:697 10 sec: 49386 operations; 4938.11 current ops/sec; est completion in 11 seconds [INSERT: Count=49386, Max=785919, Min=101, Avg=185.11, 90=227, 99=499, 99.9=3095, 99.99=6795] 
2018-12-09 04:15:53:841 17 sec: 100000 operations; 7084.83 current ops/sec; [CLEANUP: Count=1, Max=2099, Min=2098, Avg=2099, 90=2099, 99=2099, 99.9=2099, 99.99=2099] [INSERT: Count=50614, Max=460031, Min=100, Avg=137.9, 90=147, 99=229, 99.9=1231, 99.99=7207] 
[OVERALL], RunTime(ms), 17171
[OVERALL], Throughput(ops/sec), 5823.772639916137
[TOTAL_GCS_PS_Scavenge], Count, 28
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 58
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.33777881311513597
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 28
[TOTAL_GC_TIME], Time(ms), 58
[TOTAL_GC_TIME_%], Time(%), 0.33777881311513597
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2099.0
[CLEANUP], MinLatency(us), 2098
[CLEANUP], MaxLatency(us), 2099
[CLEANUP], 95thPercentileLatency(us), 2099
[CLEANUP], 99thPercentileLatency(us), 2099
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 161.21693
[INSERT], MinLatency(us), 100
[INSERT], MaxLatency(us), 785919
[INSERT], 95thPercentileLatency(us), 231
[INSERT], 99thPercentileLatency(us), 367
[INSERT], Return=OK, 100000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:02:05:433 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:02:15:280 10 sec: 3554 operations; 355.4 current ops/sec; est completion in 4 minutes [INSERT: Count=3555, Max=506111, Min=223, Avg=1742.32, 90=3099, 99=9959, 99.9=42175, 99.99=506111] 
2018-12-09 05:02:25:279 20 sec: 13322 operations; 976.8 current ops/sec; est completion in 2 minutes [INSERT: Count=9767, Max=18223, Min=198, Avg=989.32, 90=1712, 99=5283, 99.9=10527, 99.99=14063] 
2018-12-09 05:02:35:280 30 sec: 26344 operations; 1302.2 current ops/sec; est completion in 1 minute [INSERT: Count=13023, Max=18223, Min=164, Avg=745.72, 90=941, 99=3861, 99.9=6811, 99.99=15967] 
2018-12-09 05:02:45:280 40 sec: 46608 operations; 2026.4 current ops/sec; est completion in 46 seconds [INSERT: Count=20263, Max=92799, Min=109, Avg=486.01, 90=664, 99=3655, 99.9=6827, 99.99=29215] 
2018-12-09 05:02:55:279 50 sec: 67941 operations; 2133.3 current ops/sec; est completion in 24 seconds [INSERT: Count=21333, Max=229631, Min=106, Avg=459.34, 90=677, 99=2365, 99.9=8319, 99.99=19375] 
2018-12-09 05:03:05:280 60 sec: 82347 operations; 1440.6 current ops/sec; est completion in 13 seconds [INSERT: Count=14406, Max=3729407, Min=116, Avg=690.26, 90=620, 99=2505, 99.9=8279, 99.99=15551] 
2018-12-09 05:03:12:756 67 sec: 100000 operations; 2360.97 current ops/sec; [CLEANUP: Count=1, Max=13503, Min=13496, Avg=13500, 90=13503, 99=13503, 99.9=13503, 99.99=13503] [INSERT: Count=17653, Max=6903, Min=119, Avg=418.79, 90=619, 99=994, 99.9=3365, 99.99=5555] 
[OVERALL], RunTime(ms), 67482
[OVERALL], Throughput(ops/sec), 1481.8766485877716
[TOTAL_GCS_PS_Scavenge], Count, 76
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 114
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.16893393793900596
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 76
[TOTAL_GC_TIME], Time(ms), 114
[TOTAL_GC_TIME_%], Time(%), 0.16893393793900596
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 13500.0
[CLEANUP], MinLatency(us), 13496
[CLEANUP], MaxLatency(us), 13503
[CLEANUP], 95thPercentileLatency(us), 13503
[CLEANUP], 99thPercentileLatency(us), 13503
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 625.51925
[INSERT], MinLatency(us), 106
[INSERT], MaxLatency(us), 3729407
[INSERT], 95thPercentileLatency(us), 1288
[INSERT], 99thPercentileLatency(us), 3831
[INSERT], Return=OK, 100000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:03:15:776 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:03:25:657 10 sec: 5287 operations; 528.65 current ops/sec; est completion in 3 minutes [INSERT: Count=5288, Max=224383, Min=250, Avg=1353.72, 90=2003, 99=6115, 99.9=11143, 99.99=154239] 
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user2552495541608339992" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:03:32:524 16 sec: 12678 operations; 1076.31 current ops/sec; est completion in 1 minute [CLEANUP: Count=1, Max=32111, Min=32096, Avg=32104, 90=32111, 99=32111, 99.9=32111, 99.99=32111] [INSERT: Count=7390, Max=29231, Min=164, Avg=892.04, 90=1342, 99=4327, 99.9=11343, 99.99=19711] [INSERT-FAILED: Count=1, Max=87551, Min=87488, Avg=87520, 90=87551, 99=87551, 99.9=87551, 99.99=87551] 
[OVERALL], RunTime(ms), 16870
[OVERALL], Throughput(ops/sec), 751.5115589804386
[TOTAL_GCS_PS_Scavenge], Count, 13
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 36
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.21339656194427978
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 36
[TOTAL_GC_TIME_%], Time(%), 0.21339656194427978
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 32104.0
[CLEANUP], MinLatency(us), 32096
[CLEANUP], MaxLatency(us), 32111
[CLEANUP], 95thPercentileLatency(us), 32111
[CLEANUP], 99thPercentileLatency(us), 32111
[INSERT], Operations, 12678
[INSERT], AverageLatency(us), 1084.606404795709
[INSERT], MinLatency(us), 164
[INSERT], MaxLatency(us), 224383
[INSERT], 95thPercentileLatency(us), 2313
[INSERT], 99thPercentileLatency(us), 5455
[INSERT], Return=OK, 12678
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 87520.0
[INSERT-FAILED], MinLatency(us), 87488
[INSERT-FAILED], MaxLatency(us), 87551
[INSERT-FAILED], 95thPercentileLatency(us), 87551
[INSERT-FAILED], 99thPercentileLatency(us), 87551
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:03:59:095 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2018-12-09 05:04:09:057 10 sec: 7816 operations; 781.6 current ops/sec; est completion in 1 minute [INSERT: Count=7819, Max=253823, Min=170, Avg=1023.26, 90=1534, 99=6355, 99.9=14095, 99.99=28463] 
2018-12-09 05:04:19:057 20 sec: 19538 operations; 1172.08 current ops/sec; est completion in 1 minute [INSERT: Count=11719, Max=470783, Min=163, Avg=834.83, 90=1133, 99=3383, 99.9=9087, 99.99=26447] 
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:04:23:077 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user6284781860667377211" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:04:26:443 3 sec: 0 operations; est completion in 106751991167300 days 15 hours [CLEANUP: Count=1, Max=12135, Min=12128, Avg=12132, 90=12135, 99=12135, 99.9=12135, 99.99=12135] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT-FAILED: Count=1, Max=415743, Min=415488, Avg=415616, 90=415743, 99=415743, 99.9=415743, 99.99=415743] 
[OVERALL], RunTime(ms), 3477
[OVERALL], Throughput(ops/sec), 0.0
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 42
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.2079378774805867
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 42
[TOTAL_GC_TIME_%], Time(%), 1.2079378774805867
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 12132.0
[CLEANUP], MinLatency(us), 12128
[CLEANUP], MaxLatency(us), 12135
[CLEANUP], 95thPercentileLatency(us), 12135
[CLEANUP], 99thPercentileLatency(us), 12135
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), 9223372036854775807
[INSERT], MaxLatency(us), 0
[INSERT], 95thPercentileLatency(us), 0
[INSERT], 99thPercentileLatency(us), 0
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 415616.0
[INSERT-FAILED], MinLatency(us), 415488
[INSERT-FAILED], MaxLatency(us), 415743
[INSERT-FAILED], 95thPercentileLatency(us), 415743
[INSERT-FAILED], 99thPercentileLatency(us), 415743
2018-12-09 05:04:29:058 30 sec: 34655 operations; 1511.85 current ops/sec; est completion in 57 seconds [INSERT: Count=15117, Max=1267711, Min=135, Avg=649.4, 90=832, 99=4053, 99.9=10191, 99.99=27023] 
2018-12-09 05:04:39:057 40 sec: 53077 operations; 1842.2 current ops/sec; est completion in 36 seconds [INSERT: Count=18422, Max=92927, Min=114, Avg=536.09, 90=751, 99=3903, 99.9=9687, 99.99=16167] 
2018-12-09 05:04:49:057 50 sec: 72266 operations; 1918.9 current ops/sec; est completion in 20 seconds [INSERT: Count=19189, Max=1114111, Min=113, Avg=516.07, 90=746, 99=3413, 99.9=9207, 99.99=20399] 
2018-12-09 05:04:59:057 60 sec: 93775 operations; 2150.9 current ops/sec; est completion in 4 second [INSERT: Count=21509, Max=115519, Min=110, Avg=460.55, 90=794, 99=3711, 99.9=9935, 99.99=20111] 
2018-12-09 05:05:02:841 63 sec: 100000 operations; 1645.52 current ops/sec; [CLEANUP: Count=1, Max=14799, Min=14792, Avg=14796, 90=14799, 99=14799, 99.9=14799, 99.99=14799] [INSERT: Count=6225, Max=18815, Min=116, Avg=601.42, 90=861, 99=3931, 99.9=9663, 99.99=16623] 
[OVERALL], RunTime(ms), 63783
[OVERALL], Throughput(ops/sec), 1567.8158757035574
[TOTAL_GCS_PS_Scavenge], Count, 31
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 161
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2524183559882728
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 31
[TOTAL_GC_TIME], Time(ms), 161
[TOTAL_GC_TIME_%], Time(%), 0.2524183559882728
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 14796.0
[CLEANUP], MinLatency(us), 14792
[CLEANUP], MaxLatency(us), 14799
[CLEANUP], 95thPercentileLatency(us), 14799
[CLEANUP], 99thPercentileLatency(us), 14799
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 610.29928
[INSERT], MinLatency(us), 110
[INSERT], MaxLatency(us), 1267711
[INSERT], 95thPercentileLatency(us), 1364
[INSERT], 99thPercentileLatency(us), 4021
[INSERT], Return=OK, 100000
java -cp /usr/local/ycsb-0.14.0/mongodb-binding/conf:/usr/local/ycsb-0.14.0/conf:/usr/local/ycsb-0.14.0/lib/HdrHistogram-2.1.4.jar:/usr/local/ycsb-0.14.0/lib/jackson-core-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/core-0.14.0.jar:/usr/local/ycsb-0.14.0/lib/jackson-mapper-asl-1.9.4.jar:/usr/local/ycsb-0.14.0/lib/htrace-core4-4.1.0-incubating.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-binding-0.14.0.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/logback-core-1.1.2.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/usr/local/ycsb-0.14.0/mongodb-binding/lib/mongo-java-driver-3.6.3.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
Command line: -db com.yahoo.ycsb.db.MongoDbClient -s -P workloads/workloada -p recordcount=100000 -load
YCSB Client 0.14.0

Loading workload...
Starting test.
2018-12-09 05:06:54:215 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Exception while trying bulk insert with 0
com.mongodb.MongoWriteException: E11000 duplicate key error collection: ycsb.usertable index: _id_ dup key: { : "user7123510772490260851" }
	at com.mongodb.MongoCollectionImpl.executeSingleWriteRequest(MongoCollectionImpl.java:1033)
	at com.mongodb.MongoCollectionImpl.executeInsertOne(MongoCollectionImpl.java:513)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:493)
	at com.mongodb.MongoCollectionImpl.insertOne(MongoCollectionImpl.java:487)
	at com.yahoo.ycsb.db.MongoDbClient.insert(MongoDbClient.java:270)
	at com.yahoo.ycsb.DBWrapper.insert(DBWrapper.java:221)
	at com.yahoo.ycsb.workloads.CoreWorkload.doInsert(CoreWorkload.java:562)
	at com.yahoo.ycsb.ClientThread.run(Client.java:468)
	at java.lang.Thread.run(Thread.java:748)
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
2018-12-09 05:06:57:965 3 sec: 722 operations; 187.87 current ops/sec; est completion in 8 minutes [CLEANUP: Count=1, Max=19775, Min=19760, Avg=19768, 90=19775, 99=19775, 99.9=19775, 99.99=19775] [INSERT: Count=722, Max=306175, Min=534, Avg=3158.61, 90=5411, 99=11367, 99.9=13623, 99.99=306175] [INSERT-FAILED: Count=1, Max=82239, Min=82176, Avg=82208, 90=82239, 99=82239, 99.9=82239, 99.99=82239] 
[OVERALL], RunTime(ms), 3845
[OVERALL], Throughput(ops/sec), 187.77633289986997
[TOTAL_GCS_PS_Scavenge], Count, 2
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 29
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.7542262678803641
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 29
[TOTAL_GC_TIME_%], Time(%), 0.7542262678803641
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 19768.0
[CLEANUP], MinLatency(us), 19760
[CLEANUP], MaxLatency(us), 19775
[CLEANUP], 95thPercentileLatency(us), 19775
[CLEANUP], 99thPercentileLatency(us), 19775
[INSERT], Operations, 722
[INSERT], AverageLatency(us), 3158.6135734072022
[INSERT], MinLatency(us), 534
[INSERT], MaxLatency(us), 306175
[INSERT], 95thPercentileLatency(us), 6779
[INSERT], 99thPercentileLatency(us), 11367
[INSERT], Return=OK, 722
[INSERT], Return=ERROR, 1
[INSERT-FAILED], Operations, 1
[INSERT-FAILED], AverageLatency(us), 82208.0
[INSERT-FAILED], MinLatency(us), 82176
[INSERT-FAILED], MaxLatency(us), 82239
[INSERT-FAILED], 95thPercentileLatency(us), 82239
[INSERT-FAILED], 99thPercentileLatency(us), 82239